### The goal of this notebook is to send query to retrieve the information about students who scored a 4 and above on their algebra exam.

In [1]:
import sqlite3
import pandas as pd

In [2]:
# conecto with database

In [3]:
connect = sqlite3.connect("../database/db.db")
cursor = connect.cursor()

In [4]:
# construct querry

In [5]:
querry = (
"""
SELECT * FROM exam_results
INNER JOIN students ON exam_results.student_id = students.student_id
INNER JOIN class_catalogue ON exam_results.class_id = class_catalogue.class_id
WHERE exam_results.grade >= 4 AND class_catalogue.class_name = 'algebra'
""")

In [6]:
full_data = pd.read_sql_query(querry, con=connect)

In [7]:
full_data[["name", "surname"]]

   name surname
0  Kate   Smith

In [8]:
full_data.to_html("../reports/query_result.html")